src/test/resources/airPrice/sampleMinDataPriceRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:AirPriceReq xmlns="http://www.travelport.com/schema/common_v45_0" xmlns:ns2="http://www.travelport.com/schema/air_v45_0" xmlns:ns3="http://www.travelport.com/schema/rail_v45_0" xmlns:ns4="http://www.travelport.com/soa/common/security/SessionContext_v1" AuthorizedBy="user" TargetBranch="P7093065"><BillingPointOfSaleInfo OriginApplication="UAPI"/><ns2:AirItinerary><ns2:AirSegment Group="0" Carrier="NH" FlightNumber="879" Origin="HND" Destination="SYD" DepartureTime="2018-10-01T22:20:00.000+09:00" ArrivalTime="2018-10-02T08:45:00.000+10:00" ProviderCode="1G" Key="2"/></ns2:AirItinerary><ns2:AirPricingModifiers PlatingCarrier="NH"/><SearchPassenger Code="ADT" BookingTravelerRef="f71a5d05-d530-41f3-8797-764b2439591b"/><ns2:AirPricingCommand/></ns2:AirPriceReq></soap:Body></soap:Envelope>